#+title: Custom emacs settings
#+author: Amo DelBello
#+description: "NO! The beard stays. You go."
#+startup: content

** Tree-sitter
:PROPERTIES:
:INFO:     https://www.masteringemacs.org/article/how-to-get-started-tree-sitter
:DOCS:     https://emacs-tree-sitter.github.io/getting-started/
:END:
  #+begin_src emacs-lisp
    (setq treesit-language-source-alist
     '((python "https://github.com/tree-sitter/tree-sitter-python")))

    ;; (setq major-mode-remap-alist
    ;;  '((python-mode . python-ts-mode)))
  #+end_src

  #+RESULTS:
  : ((emacs-lisp-mode . elisp-ts-mode) (python-mode . python-ts-mode))

